src/cf/InformationRegisters/ИсторияСобытийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСобытийЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыСобытийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСобытийЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавленПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаВажность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаДатаВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененыПредметы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенаИзПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытаКарточка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенаправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКИсполнениюОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдаленПредмет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ИсторияСобытийЗадач/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// История событий задач: содержит процедуры по регистрации событий с задачами.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Кто отметил задачу выполненной.
//
// Параметры:
//  ЗадачаИсполнителя - ЗадачаСсылка.ЗадачаИсполнителя - Задача.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники - Определяет, кто отметил задачу выполненной.
//
Функция КтоОтметилЗадачуВыполненной(ЗадачаИсполнителя) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИсторияСобытийЗадач.Сотрудник КАК КтоОтметилЗадачуВыполненной
		|ИЗ
		|	РегистрСведений.ИсторияСобытийЗадач КАК ИсторияСобытийЗадач
		|ГДЕ
		|	ИсторияСобытийЗадач.Задача = &ЗадачаИсполнителя
		|	И ИсторияСобытийЗадач.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийЗадач.Выполнена)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсторияСобытийЗадач.ДатаСобытия УБЫВ");
	
	Запрос.УстановитьПараметр("ЗадачаИсполнителя", ЗадачаИсполнителя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(),
		Выборка.КтоОтметилЗадачуВыполненной,
		Справочники.Сотрудники.ПустаяСсылка());
	
КонецФункции

// Возвращает данные о перенаправлении задач.
//
// Параметры:
//  ЗадачиИсполнителей - ЗадачаСсылка.ЗадачаИсполнителя - Задачи исполнителей.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные о перенаправлении задач.
//   * ПеренаправленнаяЗадача - ЗадачаСсылка.ЗадачаИсполнителя - Перенаправленная задача.
//   * ДатаПеренаправления - Дата - Дата перенаправления.
//   * КтоПеренаправил - СправочникСсылка.Сотрудники - Кто перенаправил.
//   * ОписаниеПеренаправления - Строка - Описание перенаправления.
//
Функция ДанныеОПеренаправленииЗадач(ЗадачиИсполнителей) Экспорт
	
	Если ЗадачиИсполнителей.Количество() = 0 Тогда
		
		ДанныеОПеренаправленииЗадач = Новый ТаблицаЗначений;
		ДанныеОПеренаправленииЗадач.Колонки.Добавить("ПеренаправленнаяЗадача");
		ДанныеОПеренаправленииЗадач.Колонки.Добавить("ДатаПеренаправления");
		ДанныеОПеренаправленииЗадач.Колонки.Добавить("КтоПеренаправил");
		ДанныеОПеренаправленииЗадач.Колонки.Добавить("ОписаниеПеренаправления");
		
		Возврат ДанныеОПеренаправленииЗадач;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияСобытийЗадач.Задача КАК ПеренаправленнаяЗадача,
		|	ИсторияСобытийЗадач.ДатаСобытия КАК ДатаПеренаправления,
		|	ИсторияСобытийЗадач.Сотрудник КАК КтоПеренаправил,
		|	ИсторияСобытийЗадач.Комментарий КАК ОписаниеПеренаправления
		|ИЗ
		|	РегистрСведений.ИсторияСобытийЗадач КАК ИсторияСобытийЗадач
		|ГДЕ
		|	ИсторияСобытийЗадач.Задача В(&ЗадачиИсполнителей)
		|	И ИсторияСобытийЗадач.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийЗадач.Перенаправлена)");
	
	Запрос.УстановитьПараметр("ЗадачиИсполнителей", ЗадачиИсполнителей);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает событие по задаче.
//
// Параметры:
//  Задача - Задача.ЗадачаИсполнителя - задача.
//  Событие - ПеречислеСсылка.ВидыСобытийЗадач - событие произошедшее с задачей.
//  Комментарий - Строка - комментарий события.
//  АвторСобытия - СправочникСсылка.Сотрудники - сотрудник под которым произошло событие,
//                если параметр не задан, то подставляется текущий основной сотрудник.
//
Процедура ЗаписатьСобытие(Задача, Событие, Комментарий = "", АвторСобытия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ИсторияСобытийЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	
	Если ЗначениеЗаполнено(АвторСобытия) Тогда
		МенеджерЗаписи.Сотрудник = АвторСобытия;
	Иначе
		МенеджерЗаписи.Сотрудник = Сотрудники.ОсновнойСотрудникПользователя(
			ПользователиДокументооборот.ОлицетворяемыйПользователь());
	КонецЕсли;
	
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Записывает событие открытие карточки задачи
//
// Параметры:
//  Задача - Задача.ЗадачаИсполнителя - задача.
//
Процедура ЗаписатьСобытиеОткрытаКарточка(Задача) Экспорт
	
	ЗаписатьСобытие(Задача, Перечисления.ВидыСобытийЗадач.ОткрытаКарточка);
	
КонецПроцедуры

#КонецОбласти
